Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0256GPM048.PIC
      <edc:SFRDef edc:_addr="0x1F802C30" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="CNEN0A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc087ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0----00000000000" edc:name="CNEN0A" edc:nzwidth="0x20" edc:por="----------------0----00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE0A0" edc:desc="" edc:mask="0x1" edc:name="CNIE0A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A1" edc:desc="" edc:mask="0x1" edc:name="CNIE0A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A2" edc:desc="" edc:mask="0x1" edc:name="CNIE0A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A3" edc:desc="" edc:mask="0x1" edc:name="CNIE0A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A4" edc:desc="" edc:mask="0x1" edc:name="CNIE0A4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A5" edc:desc="" edc:mask="0x1" edc:name="CNIE0A5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A6" edc:desc="" edc:mask="0x1" edc:name="CNIE0A6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A7" edc:desc="" edc:mask="0x1" edc:name="CNIE0A7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A8" edc:desc="" edc:mask="0x1" edc:name="CNIE0A8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A9" edc:desc="" edc:mask="0x1" edc:name="CNIE0A9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A10" edc:desc="" edc:mask="0x1" edc:name="CNIE0A10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A15" edc:desc="" edc:mask="0x1" edc:name="CNIE0A15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C40" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="CNSTATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff87ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x----xxxxxxxxxxx" edc:name="CNSTATA" edc:nzwidth="0x20" edc:por="----------------x----xxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATA0" edc:desc="" edc:mask="0x1" edc:name="CNSTATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA1" edc:desc="" edc:mask="0x1" edc:name="CNSTATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA2" edc:desc="" edc:mask="0x1" edc:name="CNSTATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA3" edc:desc="" edc:mask="0x1" edc:name="CNSTATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA4" edc:desc="" edc:mask="0x1" edc:name="CNSTATA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA5" edc:desc="" edc:mask="0x1" edc:name="CNSTATA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA6" edc:desc="" edc:mask="0x1" edc:name="CNSTATA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA7" edc:desc="" edc:mask="0x1" edc:name="CNSTATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA8" edc:desc="" edc:mask="0x1" edc:name="CNSTATA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA9" edc:desc="" edc:mask="0x1" edc:name="CNSTATA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA10" edc:desc="" edc:mask="0x1" edc:name="CNSTATA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA15" edc:desc="" edc:mask="0x1" edc:name="CNSTATA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802C50" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="CNEN1A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc087ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0----00000000000" edc:name="CNEN1A" edc:nzwidth="0x20" edc:por="----------------0----00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE1A0" edc:desc="" edc:mask="0x1" edc:name="CNIE1A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A1" edc:desc="" edc:mask="0x1" edc:name="CNIE1A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A2" edc:desc="" edc:mask="0x1" edc:name="CNIE1A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A3" edc:desc="" edc:mask="0x1" edc:name="CNIE1A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A4" edc:desc="" edc:mask="0x1" edc:name="CNIE1A4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A5" edc:desc="" edc:mask="0x1" edc:name="CNIE1A5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A6" edc:desc="" edc:mask="0x1" edc:name="CNIE1A6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A7" edc:desc="" edc:mask="0x1" edc:name="CNIE1A7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A8" edc:desc="" edc:mask="0x1" edc:name="CNIE1A8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A9" edc:desc="" edc:mask="0x1" edc:name="CNIE1A9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A10" edc:desc="" edc:mask="0x1" edc:name="CNIE1A10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A15" edc:desc="" edc:mask="0x1" edc:name="CNIE1A15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
