Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0256GPM048.PIC
      <edc:SFRDef edc:_addr="0x1F808AA0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="3" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="DCH1DPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH1DPTR" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHDPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHDPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808AB0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH1CSIZ" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH1CSIZ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCSIZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHCSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808AC0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH1CPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH1CPTR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xFFFF" edc:name="CHCPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808AD0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="3" edc:access="------------------------nnnnnnnn" edc:cname="DCH1DAT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="DCH1DAT" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCHPDAT" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DCHPDAT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808AE0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------n------nnnnn-rnn" edc:cname="DCH2CON" edc:desc="" edc:grp="DMAC0" edc:impl="0xfffffff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x------00000-000" edc:name="DCH2CON" edc:nzwidth="0x20" edc:por="----------------x------00000-000" edc:portals="CLR SET INV" ltx:baseofperipheral="DMAC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHPRI" edc:desc="" edc:mask="0x3" edc:name="CHPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEDET" edc:desc="" edc:mask="0x1" edc:name="CHEDET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CHAEN" edc:desc="" edc:mask="0x1" edc:name="CHAEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCHN" edc:desc="" edc:mask="0x1" edc:name="CHCHN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHAED" edc:desc="" edc:mask="0x1" edc:name="CHAED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCHNS" edc:desc="" edc:mask="0x1" edc:name="CHCHNS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CHBUSY" edc:desc="" edc:mask="0x1" edc:name="CHBUSY" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808AF0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="--------nnnnnnnnnnnnnnnnssnnn---" edc:cname="DCH2ECON" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------111111111111111100000---" edc:name="DCH2ECON" edc:nzwidth="0x20" edc:por="--------111111111111111100000---" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AIRQEN" edc:desc="" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIRQEN" edc:desc="" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATEN" edc:desc="" edc:mask="0x1" edc:name="PATEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CABORT" edc:desc="" edc:mask="0x1" edc:name="CABORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFORCE" edc:desc="" edc:mask="0x1" edc:name="CFORCE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSIRQ" edc:desc="" edc:mask="0xff" edc:name="CHSIRQ" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CHAIRQ" edc:desc="" edc:mask="0xff" edc:name="CHAIRQ" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808B00" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="DCH2INT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000--------00000000" edc:name="DCH2INT" edc:nzwidth="0x20" edc:por="--------00000000--------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHERIF" edc:desc="" edc:mask="0x1" edc:name="CHERIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHTAIF" edc:desc="" edc:mask="0x1" edc:name="CHTAIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCCIF" edc:desc="" edc:mask="0x1" edc:name="CHCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBCIF" edc:desc="" edc:mask="0x1" edc:name="CHBCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDHIF" edc:desc="" edc:mask="0x1" edc:name="CHDHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDDIF" edc:desc="" edc:mask="0x1" edc:name="CHDDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSHIF" edc:desc="" edc:mask="0x1" edc:name="CHSHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSDIF" edc:desc="" edc:mask="0x1" edc:name="CHSDIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CHERIE" edc:desc="" edc:mask="0x1" edc:name="CHERIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHTAIE" edc:desc="" edc:mask="0x1" edc:name="CHTAIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCCIE" edc:desc="" edc:mask="0x1" edc:name="CHCCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBCIE" edc:desc="" edc:mask="0x1" edc:name="CHBCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDHIE" edc:desc="" edc:mask="0x1" edc:name="CHDHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDDIE" edc:desc="" edc:mask="0x1" edc:name="CHDDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSHIE" edc:desc="" edc:mask="0x1" edc:name="CHSHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSDIE" edc:desc="" edc:mask="0x1" edc:name="CHSDIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
